#include "sys.h"


/*********************************************************************************************
* 名称：xtal_init
* 功能：系统时钟初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void xtal_init(void)
{
    SLEEPCMD &= ~0x04;              //都上电
    while(!(CLKCONSTA & 0x40));     //晶体振荡器开启且稳定
    CLKCONCMD &= ~0x47;             //选择32MHz晶体振荡器
    SLEEPCMD |= 0x04;
}



/*********************************************************************************************
* 名称：halWait
* 功能：延时函数，ms
* 参数：wait:延时时间,最大延时255ms
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void halWait(unsigned char wait)
{
    unsigned long largeWait;
    
    if(wait == 0)
    {return;}
    largeWait = ((unsigned short) (wait << 7));
    largeWait += 114*wait;
    
    largeWait = (largeWait >> CLKSPD);
    while(largeWait--);
    
    return;
}


/*********************************************************************************************
* 名称：delay_ms
* 功能：延时函数，ms
* 参数：t:延时时间
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void delay_ms(u16 t)
{
    while(t--)
    {
        halWait(1);
    }
}