#include "led.h"

u8 led_Flicker=0;

/*********************************************************************************************
* 名称：led_init
* 功能：led初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void led_init(void)
{
    P1SEL &= ~0x03;          //P1.0 P1.1为普通 I/O 口
    P1DIR |= 0x03;           //输出
    
    LED2 = 1;                //关LED
    LED1 = 1;
}


/*********************************************************************************************
* 名称：ledFlickerSet
* 功能：设置led闪烁，点亮led，50ms后熄灭
* 参数：1--LED1闪烁，2--LED2闪烁
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void ledFlickerSet(u8 led)
{
    if(led==1)
    {
        led_Flicker |= (1<<0);
    }
    else if(led==2)
    {
        led_Flicker |= (1<<1);
    }
}


/*********************************************************************************************
* 名称：ledFlicker
* 功能：led闪烁服务函数
* 参数：1--LED1闪烁，2--LED2闪烁
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void ledFlicker(u8 led)
{
    if(led==1)
    {
        if(led_Flicker&0x01)
        {
            LED1=0;
            led_Flicker &= ~(1<<0);
        }
        else
        {
            LED1=1;
        }
    }
    else if(led==2)
    {
        if(led_Flicker&0x02)
        {
            LED2=0;
            led_Flicker &= ~(1<<1);
        }
        else
        {
            LED2=1;
        }
    }
}