/*********************************************************************************************
* 文件：main.c
* 作者：fuyou 2018.03.22
* 说明：rfid el驱动
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "main.h"


u8 busSysInfo[]={"Bus system"};
u8 priceInfo[]={"Price:"};
u8 surplusInfo[]={"Surplus:"};


void update_sysDisplay()
{
    LED1 = 0;
    
    OLED_Clear();
    OLED_ShowString(0,0,busSysInfo,8);                      //显示系统信息
    OLED_ShowString(0,2,priceInfo,8);                       //显示系统票价
    oled_display(sysPrice,0);
    OLED_ShowString(0,3,surplusInfo,8);                     //显示ic卡余额
}


/*********************************************************************************************
* 名称：main
* 功能：主函数
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void main(void)
{	
	xtal_init();   
	uart0_init(115200);											//UART0初始化
	uart1_init(38400);											//UART1初始化
	led_init();                                                 //LED初始化
    key_init();                                                 //key初始化
    buzzer_ioInit();                                            //el蜂鸣器初始化
	OLED_Init();												//OLED初始化
    time1Int_init();                                            //定时器中断初始化
    
	update_sysDisplay();
    
	while(1)
	{
        pc_el();									            //el控制
    }
}
